OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * @brief    A sample provides command line interface for reading files from
 *           USB disk and writing to SPIM flash. It also provide functions of
 *           dump SPIM flash, compare USB disk file with SPIM flash,
 *           and branch to run code on SPIM.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include <stdio.h>
#include <string.h>

#include "NuMicro.h"

#include "usbh_lib.h"
#include "ff.h"
#include "diskio.h"

#define USE_USB_APLL1_CLOCK       1
#define BUFF_SIZE                 2048      /* Working buffer size                        */
#define SPIM_FLASH_MAX_SIZE       0x8000000 /* Assumed maximum flash size 128 MB          */
#define SPIM_FLASH_PAGE_SIZE      0x10000   /* SPIM flash page size, depend on flash      */
#define IS_4BYTES_ADDR            0         /* W25Q20 does not support 4-bytes address mode. */

/* 0x02h : CMD_NORMAL_PAGE_PROGRAM Command Phase Table */
SPIM_PHASE_T sWb02hWrCMD =
{
    CMD_NORMAL_PAGE_PROGRAM,                                    //Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8,  PHASE_DISABLE_DTR,       //Command Phase
    PHASE_NORMAL_MODE, PHASE_WIDTH_24, PHASE_DISABLE_DTR,       //Address Phase
    PHASE_NORMAL_MODE, PHASE_ORDER_MODE0,  PHASE_DISABLE_DTR, SPIM_OP_DISABLE,   //Data Phase
    0,
};

/* 0x0B: CMD_DMA_FAST_READ Command Phase Table */
SPIM_PHASE_T sWb03hRdCMD =
{
    CMD_DMA_FAST_READ,                                          // Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,        // Command Phase
    PHASE_NORMAL_MODE, PHASE_WIDTH_24, PHASE_DISABLE_DTR,       // Address Phase
    PHASE_NORMAL_MODE, PHASE_ORDER_MODE0, PHASE_DISABLE_DTR, SPIM_OP_DISABLE,    // Data Phase
    8,                                                          // Dummy Cycle Phase
};


typedef void (FUNC_PTR)(void);

char      usbh_path[] = { '3', ':', 0 };    /* USB drive started from 3                   */
uint8_t   idBuf[3];

#ifdef __ICCARM__
    #if (NVT_DCACHE_ON == 1)
        /* Declare a DCache-line aligned variable for the buffer.  */
        #pragma data_alignment=DCACHE_LINE_SIZE
        uint8_t  Buff1[DCACHE_ALIGN_LINE_SIZE(BUFF_SIZE)] ;                 /* Working buffer                             */
        uint8_t  Buff2[DCACHE_ALIGN_LINE_SIZE(BUFF_SIZE)] ;                 /* Working buffer                             */
    #else
        #pragma data_alignment=32
        uint8_t  Buff1[BUFF_SIZE] ;                 /* Working buffer                             */
        uint8_t  Buff2[BUFF_SIZE] ;                 /* Working buffer                             */
    #endif
#else
    #if (NVT_DCACHE_ON == 1)
        /* Declare a DCache-line aligned variable for the buffer.  */
        uint8_t  Buff1[DCACHE_ALIGN_LINE_SIZE(BUFF_SIZE)] __attribute__((aligned(DCACHE_LINE_SIZE)));     /* Working buffer                             */
        uint8_t  Buff2[DCACHE_ALIGN_LINE_SIZE(BUFF_SIZE)] __attribute__((aligned(DCACHE_LINE_SIZE)));     /* Working buffer                             */
    #else
        uint8_t  Buff1[BUFF_SIZE] __attribute__((aligned(32)));     /* Working buffer                             */
        uint8_t  Buff2[BUFF_SIZE] __attribute__((aligned(32)));     /* Working buffer                             */
    #endif

#endif

char      Line[128];                        /* Console input buffer                       */

FILINFO   Finfo;
FIL       file;


volatile uint32_t  g_tick_cnt;              /* SYSTICK timer counter                      */

NVT_ITCM void SysTick_Handler(void)
{
    g_tick_cnt++;                           /* timer tick counting 100 per second         */
}

void enable_sys_tick(int ticks_per_second)
{
    g_tick_cnt = 0;

    if (SysTick_Config(SystemCoreClock / ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");

        while (1);
    }
}

uint32_t get_ticks()
{
    return g_tick_cnt;
}

/*
 *  This function is necessary for USB Host library.
 */
void delay_us(int usec)
{
    /*
     *  Configure Timer0, clock source from HIRC_12M. Prescale 12
     */
    /* TIMER0 clock from HIRC */
    CLK_SetModuleClock(TMR0_MODULE, CLK_TMRSEL_TMR0SEL_HIRC, 0);
    CLK_EnableModuleClock(TMR0_MODULE);

    TIMER_SET_PRESCALE_VALUE(TIMER0, (12 - 1));
    /* stop timer0 */
    TIMER_Stop(TIMER0);
    /* write 1 to clear for safety */
    TIMER_ClearIntFlag(TIMER0);
    TIMER_ClearWakeupFlag(TIMER0);
    /* set timer cmp value */
    TIMER_SET_CMP_VALUE(TIMER0, usec);
    /* Timer0 config to oneshot mode */
    TIMER_SET_OPMODE(TIMER0, TIMER_ONESHOT_MODE);
    /* start timer0*/
    TIMER_Start(TIMER0);

    while (TIMER_GetIntFlag(TIMER0) == 0);
}

/*
 *  Set stack base address to SP register.
 */
#ifdef __ARMCC_VERSION                 /* for Keil compiler */
void __set_SP(uint32_t _sp)
{
    __ASM volatile("msr msp, r0");
    __ASM volatile("bx  lr");
}
#endif


void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable clock */
    CLK_EnableXtalRC(CLK_SRCCTL_HXTEN_Msk);
    CLK_EnableXtalRC(CLK_SRCCTL_HIRCEN_Msk);
    CLK_EnableXtalRC(CLK_SRCCTL_HIRC48MEN_Msk);

    /* Wait for clock ready */
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
    CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);

    /* Switch SCLK clock source to PLL0 and Enable PLL0 220MHz clock */
    CLK_SetBusClock(CLK_SCLKSEL_SCLKSEL_APLL0, CLK_APLLCTL_APLLSRC_HXT, FREQ_220MHZ);

#if (USE_USB_APLL1_CLOCK)
    /* Enable APLL1 96MHz clock */
    CLK_EnableAPLL(CLK_APLLCTL_APLLSRC_HXT, 96000000, CLK_APLL1_SELECT);
#endif

    /* Enable GPIOA module clock */
    CLK_EnableModuleClock(GPIOA_MODULE);
    CLK_EnableModuleClock(GPIOB_MODULE);
    CLK_EnableModuleClock(GPIOC_MODULE);
    CLK_EnableModuleClock(GPIOD_MODULE);
    CLK_EnableModuleClock(GPIOE_MODULE);
    CLK_EnableModuleClock(GPIOF_MODULE);
    CLK_EnableModuleClock(GPIOG_MODULE);
    CLK_EnableModuleClock(GPIOH_MODULE);
    CLK_EnableModuleClock(GPIOI_MODULE);
    CLK_EnableModuleClock(GPIOJ_MODULE);
    CLK_EnableModuleClock(SPIM0_MODULE);

