OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
        val = val * r + c;
        c = *(++(*str));
    }

    if (s) val = 0 - val;           /* apply sign if needed */

    *res = val;
    return 1;
}

static void  dump_buff_hex(uint32_t addr, uint8_t *pucBuff, int nBytes)
{
    int     nIdx, i;

    nIdx = 0;

    while (nBytes > 0)
    {
        printf("0x%08X  ", addr + nIdx);

        for (i = 0; i < 16; i++)
            printf("%02x ", pucBuff[nIdx + i]);

        printf("  ");

        for (i = 0; i < 16; i++)
        {
            if ((pucBuff[nIdx + i] >= 0x20) && (pucBuff[nIdx + i] < 127))
                printf("%c", pucBuff[nIdx + i]);
            else
                printf(".");

            nBytes--;
        }

        nIdx += 16;
        printf("\n");
    }

    printf("\n");
}

int  show_root_dir()
{
    long    p1;                             /* total file size counter                    */
    FRESULT res;                            /* FATFS operation return code                */

    DIR dir;                                /* FATFS directory object                     */
    UINT s1, s2;                            /* file and directory counter                 */

    if (f_opendir(&dir, usbh_path))         /* try to open USB drive root directory       */
        return -1;                          /* open failed                                */

    p1 = s1 = s2 = 0;                       /* initialize counters                        */

    for (; ;)                               /* loop until reached end of root directory   */
    {
        res = f_readdir(&dir, &Finfo);      /* read directory entry                       */

        if ((res != FR_OK) || !Finfo.fname[0]) break;  /* no more entries                 */

        if (Finfo.fattrib & AM_DIR)         /* is a directory?                            */
        {
            s2++;                           /* increase directory counter                 */
        }
        else                                /* should be a file                           */
        {
            s1++;                           /* increase file counter                      */
            p1 += Finfo.fsize;              /* increase total file size counter           */
        }

        /* print file entry information               */
        printf("%c%c%c%c%c %u/%02u/%02u %02u:%02u %9u  %s",
               (Finfo.fattrib & AM_DIR) ? 'D' : '-',    /* is a directory?                */
               (Finfo.fattrib & AM_RDO) ? 'R' : '-',    /* is read-only?                  */
               (Finfo.fattrib & AM_HID) ? 'H' : '-',    /* is hidden?                     */
               (Finfo.fattrib & AM_SYS) ? 'S' : '-',    /* is system file/directory?      */
               (Finfo.fattrib & AM_ARC) ? 'A' : '-',    /* is an archive?                 */
               (Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,       /* date */
               (Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63, Finfo.fsize, Finfo.fname);    /* time */
#if _USE_LFN

        for (p2 = strlen(Finfo.fname); p2 < 14; p2++)   /* print the long file name       */
            putchar(' ');

        printf("%s\n", Lfname);
#else
        putchar('\n');
#endif
    }

    /* print the statistic information            */
    printf("%4u File(s),%10lu bytes total\n%4u Dir(s)\n\n", s1, p1, s2);
    return 0;
}

/*
 *  w <file> <addr>
 */
int  write_file_to_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    char        fname[64];                  /* file name string pointer                   */
    uint32_t    faddr, page_addr, addr;     /* flash address                              */
    UINT        len;                        /* data length                                */
    FRESULT     res;                        /* FATFS operation return code                */

    while (*ptr == ' ') ptr++;              /* skip space characters                      */

    for (len = 0; len < 60; len++)
    {
        if ((*ptr == ' ') || (*ptr == 0))
            break;

        fname[len] = *ptr++;
    }

    fname[len] = 0;

    if (!xatoi(&ptr, &faddr))               /* get <addr> parameter (SPIM flash address)  */
    {
        printf("Usage:  w <file> <addr>\n");
        return -1;
    }

    faddr = faddr - (faddr % SPIM_FLASH_PAGE_SIZE);  /* force page alignment              */

    printf("Write file [%s] to SPIM address 0x%x...\n", fname, faddr);
    res = f_open(&file, fname, FA_OPEN_EXISTING | FA_READ);   /* Open file                */

    if (res)
    {
        put_rc(res);                        /* Open failed, print error message           */
        return -1;                          /* Abort...                                   */
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    //SPIM_Enable_4Bytes_Mode(SPIM0, IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    /*
     *  Erase SPIM flash page and program...
     */
    for (page_addr = faddr; page_addr < SPIM_FLASH_MAX_SIZE; page_addr += SPIM_FLASH_PAGE_SIZE)
    {
        if (f_eof(&file))
        {
            printf("OK [%d]\n", res);
            f_close(&file);             /* close file                                 */
            return 0;                   /* done                                       */
        }

        /* Erase SPIM flash */
        printf("Erase flash page 0x%x...\n", page_addr);
        SPIM_EraseBlock(SPIM0, page_addr, IS_4BYTES_ADDR, OPCODE_BE_64K, 1, 1);

        memset(Buff2, 0xff, BUFF_SIZE);     /* prepared compare buffer                    */

        /* Verify erased page */
        printf("Verify erased page...");

        for (addr = page_addr; addr < page_addr + SPIM_FLASH_PAGE_SIZE; addr += BUFF_SIZE)
        {
            memset(Buff1, 0x11, BUFF_SIZE); /* fill buffer with non-0xFF                  */

            /* DMA read SPIM flash                                                        */
            SPIM_DMA_Read(SPIM0, addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff1, sWb03hRdCMD.u32CMDCode, 1);

#if (NVT_DCACHE_ON == 1)
            /* Invalidate the data cache for the SPIM read buffer to ensure data coherency if D-Cache is enabled. */
            SCB_InvalidateDCache_by_Addr((void *)&Buff1, BUFF_SIZE);
#endif

