OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
            if (memcmp(Buff1, Buff2, BUFF_SIZE) != 0)
            {
                printf("Verify address 0x%x failed!\n", addr);
                f_close(&file);             /* close file                                 */
                return -1;                  /* non-0xFF data found, erase failed          */
            }
        }

        printf("OK.\n");

        printf("Program page and verify...");

        for (addr = page_addr; addr < page_addr + SPIM_FLASH_PAGE_SIZE; addr += BUFF_SIZE)
        {
            res = f_read(&file, Buff1, BUFF_SIZE, &len);

            if (res || (len == 0))
            {
                printf("OK [%d]\n", res);
                f_close(&file);             /* close file                                 */
                return 0;                   /* done                                       */
            }

#if (NVT_DCACHE_ON == 1)
            /* Invalidate the data cache for the SPIM write buffer to ensure data coherency if D-Cache is enabled. */
            SCB_CleanDCache_by_Addr((void *)&Buff1, BUFF_SIZE);
#endif
            /* DMA write SPIM flash                       */
            SPIM_DMA_Write(SPIM0, addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff1, sWb02hWrCMD.u32CMDCode);

            memset(Buff2, 0, BUFF_SIZE);
            /* DMA read SPIM flash                        */
            SPIM_DMA_Read(SPIM0, addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff2, sWb03hRdCMD.u32CMDCode, 1);

#if (NVT_DCACHE_ON == 1)
            /* Invalidate the data cache for the SPIM read buffer to ensure data coherency if D-Cache is enabled. */
            SCB_InvalidateDCache_by_Addr((void *)&Buff2, BUFF_SIZE);
#endif

            if (memcmp(Buff1, Buff2, BUFF_SIZE) != 0)
            {
                printf("Failed at address 0x%x!\n", addr);
                f_close(&file);             /* close file                                 */
                return -1;
            }

            printf(".");
        }

        printf("OK\n");
    }

    return 0;
}

/*
 *  c <file> <addr>
 */
int  compare_file_with_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    char        fname[64];                  /* file name string pointer                   */
    uint32_t    faddr, page_addr, addr;     /* flash address                              */
    UINT        i, len;                     /* data length                                */
    FRESULT     res;                        /* FATFS operation return code                */

    while (*ptr == ' ') ptr++;              /* skip space characters                      */

    for (len = 0; len < 60; len++)
    {
        if ((*ptr == ' ') || (*ptr == 0))
            break;

        fname[len] = *ptr++;
    }

    fname[len] = 0;

    if (!xatoi(&ptr, &faddr))               /* get <addr> parameter (SPIM flash address)  */
    {
        printf("Usage:  c <file> <addr>\n");
        return -1;
    }

    faddr = faddr - (faddr % SPIM_FLASH_PAGE_SIZE);  /* force page alignment              */

    printf("Compare file [%s] with SPIM address 0x%x...\n", fname, faddr);
    res = f_open(&file, fname, FA_OPEN_EXISTING | FA_READ);   /* Open file                */

    if (res)
    {
        put_rc(res);                        /* Open failed, print error message           */
        return -1;                          /* Abort...                                   */
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    //SPIM_Enable_4Bytes_Mode(SPIM0, IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    /*
     *  Compare ...
     */
    for (page_addr = faddr; page_addr < SPIM_FLASH_MAX_SIZE; page_addr += SPIM_FLASH_PAGE_SIZE)
    {
        printf("Comparing...");

        for (addr = page_addr; addr < page_addr + SPIM_FLASH_PAGE_SIZE; addr += BUFF_SIZE)
        {
            memset(Buff1, 0xff, BUFF_SIZE); /* fill 0xff to clear buffer                  */
            memset(Buff2, 0, BUFF_SIZE);    /* fill 0x00 to clear buffer                  */

            res = f_read(&file, Buff1, BUFF_SIZE, &len);

            if (res || (len == 0))
            {
                printf("Compare OK.\n");
                f_close(&file);             /* close file                                 */
                return 0;                   /* done                                       */
            }

            /* DMA read SPIM flash                        */
            SPIM_DMA_Read(SPIM0, addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff2, sWb03hRdCMD.u32CMDCode, 1);

#if (NVT_DCACHE_ON == 1)
            /* Invalidate the data cache for the SPIM read buffer to ensure data coherency if D-Cache is enabled. */
            SCB_InvalidateDCache_by_Addr((void *)&Buff2, BUFF_SIZE);
#endif

            if (memcmp(Buff1, Buff2, len) != 0)
            {
                for (i = 0; i < len; i++)
                    printf("0x%04x: 0x%02x  0x%02x\n", addr + i, Buff1[i], Buff2[i]);

                printf("Compare failed!\n");
                f_close(&file);             /* close file                                 */
                return -1;
            }

            printf(".");
        }

        printf("OK\n");
    }

    return 0;
}

/*
 *  d <addr> <len>
 */
int  dump_spim_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    uint32_t    faddr, addr;                /* flash address                              */
    uint32_t    dump_len;                   /* dump length                                */
    UINT        len;                        /* data length                                */

    if (!xatoi(&ptr, &faddr))               /* get <addr> parameter (SPIM flash address)  */
    {
        printf("Usage:  d <addr> <len>\n");
        return -1;
    }

    faddr = faddr - (faddr % BUFF_SIZE);    /* force block alignment                      */

    if (!xatoi(&ptr, &dump_len))            /* get <len> parameter (data dump length)     */
    {
        printf("Usage:  d <addr> <len>\n");
        return -1;
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

