OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
    //SPIM_Enable_4Bytes_Mode(SPIM0, IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    /*
     *  Read and dump ...
     */
    for (addr = faddr; dump_len > 0; addr += BUFF_SIZE)
    {
        memset(Buff1, 0, BUFF_SIZE);        /* fill 0x00 to clear buffer                  */

        /* DMA read SPIM flash                        */
        SPIM_DMA_Read(SPIM0, addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff1, sWb03hRdCMD.u32CMDCode, 1);

#if (NVT_DCACHE_ON == 1)
        /* Invalidate the data cache for the SPIM read buffer to ensure data coherency if D-Cache is enabled. */
        SCB_InvalidateDCache_by_Addr((void *)&Buff1, BUFF_SIZE);
#endif

        if (dump_len < BUFF_SIZE)
            len = dump_len;
        else
            len = BUFF_SIZE;

        dump_buff_hex(addr, Buff1, len);    /* dump data                                  */
        dump_len -= len;
    }

    return 0;
}

/*
 *  g <addr>
 *
 *  Example:
 *  Assumed the image located on SPIM flash offset address 0x2000. It's RO_BASE must
 *  be (SPIM_DMM_MAP_ADDR+0x2000). To branch and run this image, user must issue
 *  command "g 0x2000".
 */
int  go_to_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    uint32_t    faddr;                      /* flash address                              */
    FUNC_PTR    *func;                      /* function pointer                           */

    if (!xatoi(&ptr, &faddr))               /* get <addr> parameter (SPIM flash address)  */
    {
        printf("Usage:  g <addr>\n");
        return -1;
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    //SPIM_Enable_4Bytes_Mode(SPIM0, IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    /* Enable DMM mode                            */
    SPIM_EnterDirectMapMode(SPIM0, IS_4BYTES_ADDR, sWb03hRdCMD.u32CMDCode, 1);

    func = (FUNC_PTR *)(SPIM_DMM0_SADDR + faddr + 1);

    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;   /* disable SYSTICK (prevent interrupt)   */

    func();                                      /* branch to SPIM                        */

    return 0;
}

int SPIM_TrimRXClkDlyNum(SPIM_T *pSPIMx, SPIM_PHASE_T *psWbRdCMD)
{
    volatile uint8_t u8RdDelay = 0;
    uint8_t u8RdDelayIdx = 0;
    uint8_t u8RdDelayRes[0x0F] = {0};
    uint32_t u32SAddr = 0x0;
    volatile uint32_t u32i = 0;
    uint32_t u32Div = SPIM_GET_CLOCK_DIVIDER(pSPIMx);
    uint8_t au8TrimPatten[32] =
    {
        0xff, 0x0F, 0xFF, 0x00, 0xFF, 0xCC, 0xC3, 0xCC,
        0xC3, 0x3C, 0xCC, 0xFF, 0xFE, 0xFF, 0xFE, 0xEF,
        0xFF, 0xDF, 0xFF, 0xDD, 0xFF, 0xFB, 0xFF, 0xFB,
        0xBF, 0xFF, 0x7F, 0xFF, 0x77, 0xF7, 0xBD, 0xEF,
    };
    uint8_t au8CmpBuf[32] = {0};
#ifdef DMM_MODE_TRIM
    uint32_t u32RdDataCnt = 0;
    uint32_t u32DMMAddr = SPIM_GetDMMAddress(pSPIMx);
    uint32_t *pu32RdData = NULL;
#endif //

    SPIM_SET_CLOCK_DIVIDER(pSPIMx, 8);

    SPIM_EraseBlock(pSPIMx, u32SAddr, SPIM_OP_DISABLE, OPCODE_BE_64K, 1, SPIM_OP_ENABLE);

    SPIM_DMA_Write(pSPIMx, u32SAddr, SPIM_OP_DISABLE, sizeof(au8TrimPatten), au8TrimPatten, sWb02hWrCMD.u32CMDCode);

    SPIM_SET_CLOCK_DIVIDER(pSPIMx, u32Div);

#ifdef DMM_MODE_TRIM
    SPIM_DMM_ReadPhase(pSPIMx, psWbRdCMD, 1);
#endif

    for (u8RdDelay = 0; u8RdDelay <= 0xF; u8RdDelay++)
    {
        SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMx, u8RdDelay);

        memset(au8CmpBuf, 0, sizeof(au8TrimPatten));

#ifndef DMM_MODE_TRIM
        SPIM_DMA_Read(pSPIMx, u32SAddr, SPIM_OP_DISABLE,  sizeof(au8TrimPatten), au8CmpBuf, sWb03hRdCMD.u32CMDCode, SPIM_OP_ENABLE);
#if (NVT_DCACHE_ON == 1)
        /* Invalidate the data cache for the SPIM read buffer to ensure data coherency if D-Cache is enabled. */
        SCB_InvalidateDCache_by_Addr((void *)au8CmpBuf, sizeof(au8CmpBuf));
#endif
#else
        u32RdDataCnt = 0;
        pu32RdData = (uint32_t *)tstbuf2;

        //SPIM_IO_ReadPhase(pSPIMx, pMT0BhRdCMD, u32SAddr, tstbuf2, sizeof(au8TrimPatten));

        for (u32i = u32SAddr; u32i < (u32SAddr + sizeof(au8TrimPatten)); u32i += 4)
        {
            pu32RdData[u32RdDataCnt++] = inpw(u32DMMAddr + u32i);
        }

#endif

        // Compare.
        if (memcmp(au8TrimPatten, au8CmpBuf, sizeof(au8TrimPatten)) == 0)
        {
            printf("RX Delay: %d = Pass\r\n", u8RdDelay);
            u8RdDelayRes[u8RdDelayIdx++] = u8RdDelay;
        }
    }

    if (u8RdDelayIdx >= 2)
    {
        u8RdDelayIdx = (u8RdDelayIdx / 2) /*- 1*/;
    }
    else
    {
        u8RdDelayIdx = 0;
    }

    printf("\r\nRX Delay = %d\r\n\r\n", u8RdDelayRes[u8RdDelayIdx]);
    SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMx, u8RdDelayRes[u8RdDelayIdx]);

    return u8RdDelay;
}

int32_t main(void)
{
    char        *ptr;                       /* str pointer                                */

    SYS_Init();                             /* Init System, clock and I/O pins.           */

    InitDebugUart();                        /* Init DeubgUART for printf */

    enable_sys_tick(100);

    printf("\n\n");
    printf("+-----------------------------------------------+\n");
    printf("|   USB SPIM writer                             |\n");
    printf("+-----------------------------------------------+\n");

    SYS_UnlockReg();                             /* Unlock register lock protect               */

    SPIM_SET_CLOCK_DIVIDER(SPIM0, 8);            /* Set SPIM clock as HCLK divided by 4        */

    SPIM_DISABLE_CIPHER(SPIM0);

    if (SPIM_InitFlash(SPIM0, SPIM_OP_ENABLE) != 0)            /* Initialized SPI flash                      */
    {
        printf("SPIM flash initialize failed!\n");

        while (1);
    }

    SPIM_ReadJedecId(SPIM0, idBuf, sizeof(idBuf), 1);   /* read SPIM flash ID                   */
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    usbh_core_init();                       /* initialize USB Host library                */
    usbh_umas_init();                       /* initialize USB mass storage driver         */
    usbh_pooling_hubs();                    /* monitor USB hub ports                      */

    f_chdrive(usbh_path);                   /* set default path                           */

    SPIM_DMADMM_InitPhase(SPIM0, &sWb03hRdCMD, SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_DMADMM_InitPhase(SPIM0, &sWb02hWrCMD, SPIM_CTL0_OPMODE_PAGEWRITE);
    SPIM_DMADMM_InitPhase(SPIM0, &sWb03hRdCMD, SPIM_CTL0_OPMODE_DIRECTMAP);

