OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
    /* Trim RX clock delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    SPIM_TrimRXClkDlyNum(SPIM0, &sWb03hRdCMD);

    /*
     *  Erase flash page
     */
    printf("Erase SPI flash block 0x%x...", 0);
    SPIM_EraseBlock(SPIM0, 0, 0, OPCODE_BE_64K, 1, 1);
    printf("done.\n");

    for (;;)
    {
        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = Line;

        get_line(ptr, sizeof(Line));

        switch (*ptr++)
        {

            case 'h':
            case '?':                           /* Show usage                                 */
                printf(
                    _T("l - List root directory files\n")
                    _T("w <file> <addr> - Write a file to SPIM flash. <addr> is an offset from SPIM flash base.\n")
                    _T("c <file> <addr> - Compare a file with SPIM flash. <addr> is an offset from SPIM flash base.\n")
                    _T("d <addr> <len> - Dump SPIM offset <addr> contents.\n")
                    _T("g <addr> - Branch to SPIM offset <addr> and execute.\n")
                );
                break;

            case 'l' :                          /* List root directory files                  */
                show_root_dir();
                break;

            case 'w' :                          /* w <file> <addr>                            */
                write_file_to_flash(ptr);       /* Write a file to SPIM flash.                */
                break;

            case 'c' :                          /* c <file> <addr>                            */
                compare_file_with_flash(ptr);   /* Compare a file with SPIM flash block.      */
                break;

            case 'd' :                          /* d <addr> <len>                             */
                dump_spim_flash(ptr);           /* Dump contents of a SPIM flash block.       */
                break;

            case 'g' :                          /* g <addr>                                   */
                go_to_flash(ptr);               /* Branch to SPIM flash offset <addr>         */
                break;
        }
    }
}
